#### Terraform Plan 📋
```
aws_instance.msp_02: Refreshing state... [id=i-06fe15a7fef4b7ba1]
aws_security_group.msp_sg: Refreshing state... [id=sg-0f80ad8990d4e7534]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.msp_02 will be destroyed
  # (because aws_instance.msp_02 is not in configuration)
  - resource "aws_instance" "msp_02" {
      - ami                                  = "ami-0fc6cf99992956a4a" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:288761743095:instance/i-06fe15a7fef4b7ba1" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-06fe15a7fef4b7ba1" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "whh-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-014c3ef50e582b72d" -> null
      - private_dns                          = "ip-172-31-13-197.ec2.internal" -> null
      - private_ip                           = "172.31.13.197" -> null
      - public_dns                           = "ec2-98-92-119-51.compute-1.amazonaws.com" -> null
      - public_ip                            = "98.92.119.51" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "msp-server-sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-08b472fed1ecf6c41" -> null
      - tags                                 = {
          - "Name" = "msp-02"
        } -> null
      - tags_all                             = {
          - "Environment" = "production"
          - "ManagedBy"   = "terraform"
          - "Name"        = "msp-02"
          - "Project"     = "msp-infrastructure"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "96adf618926f7f6023a627679ea74941cbfd9e20" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0f80ad8990d4e7534",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {
              - "Environment" = "production"
              - "ManagedBy"   = "terraform"
              - "Project"     = "msp-infrastructure"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-008aa908768254784" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_s3_bucket.msp_storage will be created
  + resource "aws_s3_bucket" "msp_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "msp-storage-288761743095"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "msp-storage"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "msp-storage"
          + "Project"     = "msp-infrastructure"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_versioning.msp_storage will be created
  + resource "aws_s3_bucket_versioning" "msp_storage" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.msp_sg will be destroyed
  # (because aws_security_group.msp_sg is not in configuration)
  - resource "aws_security_group" "msp_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:288761743095:security-group/sg-0f80ad8990d4e7534" -> null
      - description            = "Security group for MSP servers" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f80ad8990d4e7534" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Grafana"
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3000
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Prometheus"
              - from_port        = 9090
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9090
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "SSH"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "msp-server-sg" -> null
      - owner_id               = "288761743095" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "msp-server-sg"
        } -> null
      - tags_all               = {
          - "Environment" = "production"
          - "ManagedBy"   = "terraform"
          - "Name"        = "msp-server-sg"
          - "Project"     = "msp-infrastructure"
        } -> null
      - vpc_id                 = "vpc-0bc6860db0fd88bed" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - msp_02_instance_id = "i-06fe15a7fef4b7ba1" -> null
  - msp_02_public_ip   = "98.92.119.51" -> null
  + s3_bucket_name     = "msp-storage-288761743095"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @imzouwei-lang*